CSI API ETABS v1
cPropArea.SetSlabWaffle Method
 Initializes a waffle slab section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSlabWaffle(
	string Name,
	double OverallDepth,
	double SlabThickness,
	double StemWidthTop,
	double StemWidthBot,
	double RibSpacingDir1,
	double RibSpacingDir2
)
Function SetSlabWaffle (
	Name As String,
	OverallDepth As Double,
	SlabThickness As Double,
	StemWidthTop As Double,
	StemWidthBot As Double,
	RibSpacingDir1 As Double,
	RibSpacingDir2 As Double
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim OverallDepth As Double
Dim SlabThickness As Double
Dim StemWidthTop As Double
Dim StemWidthBot As Double
Dim RibSpacingDir1 As Double
Dim RibSpacingDir2 As Double
Dim returnValue As Integer
returnValue = instance.SetSlabWaffle(Name,
	OverallDepth, SlabThickness, StemWidthTop,
	StemWidthBot, RibSpacingDir1, RibSpacingDir2)
int SetSlabWaffle(
	String^ Name,
	double OverallDepth,
	double SlabThickness,
	double StemWidthTop,
	double StemWidthBot,
	double RibSpacingDir1,
	double RibSpacingDir2
)
abstract SetSlabWaffle :
        Name : string *
        OverallDepth : float *
        SlabThickness : float *
        StemWidthTop : float *
        StemWidthBot : float *
        RibSpacingDir1 : float *
        RibSpacingDir2 : float -> int
Parameters
Name
Type: System.String
 The name of an existing waffle slab property.
OverallDepth
Type: System.Double
 Overall Depth
SlabThickness
Type: System.Double
 Slab Thickness
StemWidthTop
Type: System.Double
 Stem Width at Top
StemWidthBot
Type: System.Double
 Stem Width at Bottom
RibSpacingDir1
Type: System.Double
 Spacing of Ribs that are Parallel to Slab 1-Axis
RibSpacingDir2
Type: System.Double
 Spacing of Ribs that are Parallel to Slab 2-Axis
Return Value
Type: Int32
 The function returns zero if the property data is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim SlabType As eSlabType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
       Dim OverallDepth As Double
       Dim SlabThickness As Double
       Dim StemWidthTop As Double
       Dim StemWidthBot As Double
       Dim RibSpacing1 As Double
       Dim RibSpacing2 As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetSlab("MyShellProp1A", eSlabType.Waffle, eShellType.ShellThin, "4000Psi", 14.2)
   'set new area property
       ret = SapModel.PropArea.SetSlabWaffle(Name:="MyShellProp1A", OverallDepth:=11.1, SlabThickness:=22.2, StemWidthTop:=33.3, StemWidthBot:=44.4, RibSpacingDir1:=55.5, RibSpacingDir2:=66.6)
   'get area property data
       ret = SapModel.PropArea.GetSlab("MyShellProp1A", SlabType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'get area property data
       ret = SapModel.PropArea.GetSlabWaffle("MyShellProp1A", OverallDepth, SlabThickness, StemWidthTop, StemWidthBot, RibSpacing1, RibSpacing2)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace